Revit 2024 API
BuiltInFailures.ColumnFailures.ColumnBaseAboveTopError Property
 The column base can't be moved above its top.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ColumnBaseAboveTopError { get; }
Visual Basic
Public Shared ReadOnly Property ColumnBaseAboveTopError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ColumnBaseAboveTopError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace